steps_yesterday = 8452
steps_today = 6783

# Вычислите сумму здесь: вместо многоточия напишите выражение,
# суммирующее количество шагов за два дня
steps_sum = steps_yesterday + steps_today

print('Сколько шагов сделал Геннадий за два дня?')
print(steps_sum)