example_str = 'Кабачки полезны для здоровья.'

# Напишите свой код здесь.
example_str_list = list(example_str)
print(example_str_list[0])
print(example_str_list[10])
print(example_str_list[1])
print(example_str_list[-8])